package com.first.lesson6;
/* Дана дата. Необходимо определить время года (зима, весна, лето, осень) и вывести в консоль.*/
import java.util.Date;

public class exe2 {
    Date firstDate1 = new Date();
/* Не смог понять, как сделать переменную с датой и вытащить оттуда месяцы в числах и сравнить
в формате if (m < 12; m > 9) {System.out.prinln ("Осень")}
 */
    public static void main(String[] args) {
        System.out.println();

    }
}
